[{
  "name": "MSFDA-TISS Assessment and Learning \n",
  "about": "The program focuses on perspective-building and techniques related to formative assessment of students. The approach enables faculty to make the assessments more productive towards teaching and learning.",
  "video": "https://www.youtube.com/embed/GF2vIaPG7iM",
  "eligibility": "Higher education faculty from any discipline.",
  "coordinator": [
    {
      "name": "Dr. Geetanjali Date",
      "number": "9881728333",
      "email": "geetpn@gmail.com"
    }
  ],
  "overview": "The program aspires to develop faculty capacity to improve quality of assessment and type of assessment task, innovate assessment methodologies – open, seminar, peer etc., align assessment to learning goals and competencies, giving feedback, using technology and technologically-assisted assessment. It hopes to develop the ability to enhance validity and reliability of assessment, and to ensure that assessment addresses inclusion effectively. \n",
  "info": {
    "mode": " Hybrid - Face-to-face residential, followed by two half-day online engagements",
    "duration": "3 Day's"
  },
  "centreid": "7",
  "partner": {
    "name": "Tata Institute of Social Sciences (TISS)",
    "about": "Tata Institute of Social Sciences (TISS) is a multi-campus public research university in Mumbai, India. The vision of TISS is to be an institution of excellence in higher education that continually responds to changing social realities through the development and application of knowledge, towards creating a people-centred, ecologically sustainable and just society that promotes and protects dignity, equality, social justice and human rights for all. \n"
  },
  "courseid": "07/02"
},{
  "name": "MSFDA-Rotary Sanrachana - Creating Constructivist Classrooms ",
  "about": "The program envisages introducing educators to learner-centric, empathetic, constructivist teaching learning strategies aligned with NEP 2020 and demonstrating these, along with use of technology in their classrooms. Constructivist design makes learning an active and social process for the learners, engaging them better and fostering critical thinking, creativity, collaboration, and communication in the classroom. ",
  "video": "https://www.youtube.com/embed/GF2vIaPG7iM",
  "eligibility": " Higher education faculty and/or teaching-supporting staff from any discipline.",
  "coordinator": [
    {
      "name": "Dr. Geetanjali Date",
      "number": "9881728333",
      "email": "geetpn@gmail.com"
    }
  ],
  "overview": "Enabling a healthy and open learning environment in colleges requires efforts at various levels and includes addressing concerns related to access, inclusion, safety, comfort and importantly ensuring dignity. Also, it calls for teaching that it is relevant to the context/reality of the student and empowers him/her to be able to make meaningful decisions. One of the possible and important factors to enable critical and creative thinking abilities among students is through the Constructivist Classroom approach that focuses on building learning from what students know, their knowledge and builds further a dialogic model of learning which includes negotiation and questioning as core to learning.",
  "info": {
    "mode": "  Face-to-face residentia",
    "duration": "5 day's"
  },
  "centreid": "7",
  "partner": {
    "name": "Rotary District 3131",
    "about": "Rotary District 3131 covers the geographical area of Pune and Raigad districts in Maharashtra. There are around 143 Rotary Clubs in the District and more than 5,500 active members. Rotary District 3131 is one of the most active districts in India and carries out a large number of impact making projects in areas such as Healthcare, Education, Water and Sanitation, Economic Development of Community, response to natural calamities such as cyclones, earthquakes, tsunamis, and Covid-19."
  },
  "courseid": "07/01"
},{
  "name": "Techno-Pedagogy and Andragogy, TAAL",
  "about": "8-day FDP, 5 days Residential+ 3 days online workshop and refresher course Venue: Symbiosis International University",
  "video": "https://www.youtube.com/embed/GF2vIaPG7iM",
  "eligibility": "Faculty from all domains of specialization",
  "coordinator": [
    {
      "name": "Sujata Varadrajan",
      "number": "8888806426",
      "email": "sujatha.msfda@gmail.com"
    }
  ],
  "overview": "Technology is an integral part of education. The major objective of the TAAL program is to introduce faculty members from all discipline across Maharashtra to; address diversity of learners, familiarize themselves with basic concepts of andragogy, use active learning strategies and interactive tools for learning, create a variety of assessment and evaluation strategies and construct instructional design.",
  "info": {
    "mode": "Blended",
    "duration": "8 Day's"
  },
  "centreid": "1",
  "partner": {
    "name": "Symbiosis International (Deemed University)",
    "about": "Symbiosis International (Deemed University) is a multidisciplinary university established established in 1971, by Prof. Dr. S.B. Mujumdar. Symbiosis is based on the Vedic thought “Vasudhaiva Kutumbakam‟ – “the world is one family‟. All the university campuses epitomize the Symbiosis vision, 'Promoting International Understanding through Quality Education' and are a beehive of international students from more than 85 countries across the globe. The University is awarded the Category-I status by UGC, and a n 'A' grade by NAAC with a score of 3.58 on 4.0 scale. globe."
  },
  "courseid": "01/08"
},{
  "name": "Science, Astronomy and Society",
  "about": "The idea is to expose faculty from remote parts of Maharashtra to Astronomy. The program will also instill motivation and fascination in them towards science in general, with emphasis on Astronomy and Astrophysics. The program will aim for initial sensitisation of faculty; and detailed face-to-face discussions. ",
  "video": "https://www.youtube.com/embed/GF2vIaPG7iM",
  "eligibility": "The faculty and students in higher Education from remote parts of Maharashtra",
  "coordinator": [
    {
      "name": "Dr. Apurva Barve",
      "number": "9673470984",
      "email": "geetanjali.msfda@gmail.com"
    }
  ],
  "overview": "It is a two days’ consolidated program. The experts from IUCAA will be conducting different sessions. The sky watching session with the help of the telescopes will excite the curiosity about astronomy in the mind. The theory session before sky watching will add the knowledge of the participants about the subject. The Hands on Training and theory sessions on the next day will be helpful in improving the understanding of the subject. ",
  "info": {
    "mode": "Face-to-face",
    "duration": "2 Day's"
  },
  "centreid": "5",
  "partner": {
    "name": "IUCAA",
    "about": "IUCAA is a premier national level Centre in Astronomy and Astrophysics located near Savitribai Phule Pune University Campus. The Centre is involved in several prestigious projects of international /national importance. IUCAA also provides a platform for research to more than 200 Visiting Associates, who are faculty members of higher educational institutions in the country."
  },
  "courseid": "05/01"
},{
  "name": "Through the Lens",
  "about": "A more visual approach to learning builds a rapport, creates engagement and contextualizes topics more clearly. This programme aims to expose higher education faculty from all disciplines to photography and lens based practices as a form of pedagogy and tool for engagement that fosters a creative environment. It will focus on the stories we want to tell and share while building new skills.",
  "video": "https://www.youtube.com/embed/GF2vIaPG7iM",
  "eligibility": "Higher education faculty from any discipline",
  "coordinator": [
    {
      "name": "Dr. Apurva Barve",
      "number": "9673470984",
      "email": "geetanjali.msfda@gmail.com"
    }
  ],
  "overview": "Participants will learn the skills of photography and of building stories and conversations around photographs, particularly in the context of higher education. The workshop will take place in two phases. In the first phase, the basics will be introduced and how visual storytelling can become an integral part of how we 'see', document and examine various subjects and issues around us will be explored. There will be field visits to colleges to document and communicate the workings of higher education spaces and click representative photographs. Participants will later assemble in phase 2 to share their work and discuss issues reflected through their images. An exhibition of the photographs is also envisaged. The workshop will thus combine technical learning along with real-world practice-based learning.",
  "info": {
    "mode": "Face-to-face",
    "duration": "7 Day's"
  },
  "centreid": "5",
  "partner": {
    "name": "Photography Promotion Trust (PPT)",
    "about": "PPT is a brainchild of Padmashree Awardee Shri Sudharak Olwe, a Mumbai-based photojournalist, who has worked as a press photographer with some of the leading newspapers in India. He has traveled across the country to capture incredible stories of resilience, courage and change. The PPT aims to use photography as a tool for engaging marginalized communities and support photographers to tell stories through pictures, promote the art of social documentary photography and to use it as a tool for positive impact and tangible change."
  },
  "courseid": "05/03"
},{
  "name": "Pradnya Parisar Project",
  "about": "FDP Program about learning human mind, emotions, emotional diversity & emotional wellbeing. Utilize this knowledge for creating emotional friendly campus by educating faculties on these fronts.",
  "video": "https://www.youtube.com/embed/GF2vIaPG7iM",
  "eligibility": "HEI with group of 5 to 6 Participants with below combination:",
  "coordinator": [
    {
      "name": "Mithilesh Bhakare",
      "number": "8554845384",
      "email": "mithilesh.msfda@gmail.com"
    }
  ],
  "overview": "Learning Emotions (Awareness, Acceptance, Analysis, Application) This is not only an event-based project, but there will be activities of different magnitudes. All activities will be aimed at bringing about a cohesive impact, through channelized & focused emotional wellbeing aspects education.Sustainability will be achieved through continuous training and participation. Mechanism of Action (Developing the skills to carry out the Programme at participants institution, through online follow up session.) ",
  "info": {
    "mode": "Offline",
    "duration": "5 Day's"
  },
  "centreid": "3",
  "partner": {
    "name": "The Institute for Psychological Health (IPH)",
    "about": "The Institute for Psychological Health (IPH), Thane: Sanctuary for people seeking mental health or emotional wellbeing knowledge.Also for people seeking psychological support. Provides opportunities, beginning with the redress of individual problems, gradually involving the family, and finally, the community towards healthy growth. IPH Provides an ' Umbrella' approach, i.e. many services for many age groups, under one roof. This ensures holistic intervention of the particular problem."
  },
  "courseid": "03/01"
},{
  "name": "Leadership through Outdoor Based Experiential Learning",
  "about": "Program enables participants to learn leadership and different type of leadership through outdoor activities ",
  "video": "https://www.youtube.com/embed/GF2vIaPG7iM",
  "eligibility": " Principals of Colleges and Vice Chancellors of Universities , Sports Directors of Universities and colleges",
  "coordinator": [
    {
      "name": "Deepak Chavan",
      "number": "9890142341",
      "email": "deepak.msfda@gmail.com"
    }
  ],
  "overview": "It is 3 days residential program with the goal to achieve learning beyond knowledge. It uses a Multidisciplinary approach to education that challenges the hierarchy associated with the subject. Enhances leadership acumen and thoughts .",
  "info": {
    "mode": "Offline",
    "duration": "3 Day's"
  },
  "centreid": "2",
  "partner": {
    "name": "Garudmaachi. A High Places Enterprise",
    "about": "Garudmaachi is High Places' flagship training and outdoor center. From identifying an appropriate location to developing a center that supports both outdoor and indoor needs of training programs and meets, High Places with great care created Garudmaachi, India’s only purpose-built eco-friendly center that blends with the natural habitat and yet provides necessary comfort and facilities."
  },
  "courseid": "02/03"
}]